app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salary", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "marvin"], ["salary", 30.0], ["created_at", "2018-02-09 21:34:31.527839"], ["updated_at", "2018-02-09 21:34:31.527839"]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]